# BuiltInFailures.DocumentFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DocumentFailures Class
BuiltInFailures Class Members See Also
---
Failures about DocumentFailures.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class DocumentFailures
```

Visual Basic
---
```text
Public NotInheritable Class DocumentFailures
```

Visual C++
---
```text
public ref class DocumentFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..DocumentFailures
# See Also
BuiltInFailures..::..DocumentFailures Members
Autodesk.Revit.DB Namespace